# FilletRadius Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..FilletRadius Property
ContinuousRailType Class See Also
---
The fillet radius of the rail join.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double FilletRadius { get; set; }
```

Visual Basic
---
```text
Public Property FilletRadius As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FilletRadius {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for filletRadius must be between 0 and 30000 feet. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The join option of the rail is not fillet so the data being set is not applicable. |

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace